
[FOXDAMAGETYPE_EXPLOSION_TOMAHAWK]
suicidestrings=exploded himself with Tomahawk
killstrings=killed %s
killstrings=explosively Tomahawked %s

[FOXDAMAGETYPE_KATANA]
suicidestrings=pushed the cart too far
killstrings=killed %s
killstrings=Sliced %s

[FOXDAMAGETYPE_MELEE_TOMAHAWK]
suicidestrings=pushed the cart too far
killstrings=killed %s
killstrings=chopped up %s
killstrings=hacked %s face off

[FOXDAMAGETYPE_THROWN_TOMAHAWK]
suicidestrings=pushed the cart too far
killstrings=killed %s
killstrings=chopped up %s
killstrings=hacked %s face off

[FOXDAMAGETYPE_TOMAHAWK]
suicidestrings=stabbed himself with a Tomahawk
killstrings=killed %s
killstrings=Tomahawked %s

[FOXWEAPON_EXPLODINGTOMAHAWK]
friendlyname=Exploding Tomahawk
friendlytooltip=

[FOXWEAPON_HSDECOY]
friendlyname=Hardsuit HRV Decoy
friendlytooltip=

[FOXWEAPON_KATANA]
friendlyname=Katana
friendlytooltip=

[FOXWEAPON_TOMAHAWK]
friendlyname=Sonic Tomahawk
friendlytooltip=
